// 累計CII評級 [時間戳, 值]
let CIIOverviewChart01_chart_Series_data01 = [];
// MCR% [時間戳, 值]
let CIIOverviewChart01_chart_Series_data02 = [];
// 狀態︰航行中 [時間戳, 0] [時間戳, -1.5] (若狀態為航行中，值為[時間戳, -1.5]，否則[時間戳, 0])
let CIIOverviewChart01_chart_Series_data03 = [];
// 狀態︰等泊 [時間戳, 0] [時間戳, -1.5](若狀態為等泊，值為[時間戳, -1.5]，否則[時間戳, 0])
let CIIOverviewChart01_chart_Series_data04 = [];
// 年度目標CII，包含兩個陣列分別為起、終點
// 起點 [Date.UTC(年份, 0, 1), 目標CII評級]
// 終點 [Date.UTC(年份, 12, 30), 目標CII評級]
let CIIOverviewChart01_chart_redLine = [
    [Date.UTC(2023, 0, 1), 12], // 起點
    [Date.UTC(2023, 12, 30), 12], // 終點
];
// 以上時間戳都是共用的，來自午報輸入資料

CIIOverviewChart01_chart_Series_data01 = [
    [1672531200000, 0],
    [1672617600000, 17],
    [1672704000000, 12],
    [1672790400000, 12.2],
    [1672876800000, 13.0],
    [1672963200000, 12.8],
    [1673049600000, 13.1],
    [1673136000000, 13.3],
    [1673222400000, 13.0],
    [1673308800000, 12.9],
    [1673395200000, 12.8],
    [1673481600000, 12.8],
    [1673568000000, 13.1],
    [1673654400000, 13.0],
    [1673740800000, 12.7],
    [1673827200000, 13.2],
    [1673913600000, 13.0],
    [1674000000000, 12.9],
    [1674086400000, 13.1],
    [1674172800000, 13.3],
    [1674259200000, 13.1],
    [1674345600000, 13.0],
    [1674432000000, 12.9],
    [1674518400000, 13.2],
    [1674604800000, 12.8],
    [1674691200000, 13.0],
    [1674777600000, 13.1],
    [1674864000000, 13.0],
    [1674950400000, 13.2],
    [1675036800000, 12.9],
];
CIIOverviewChart01_chart_Series_data02 = [
    [1672531200000, 0],
    [1672617600000, 27],
    [1672704000000, 62],
    [1672790400000, 68],
    [1672876800000, 64],
    [1672963200000, 63.8],
    [1673049600000, 62.4],
    [1673136000000, 60.1],
    [1673222400000, 69.8],
    [1673308800000, 0],
    [1673395200000, 0],
    [1673481600000, 0],
    [1673568000000, 65.1],
    [1673654400000, 63.0],
    [1673740800000, 72.7],
    [1673827200000, 73.2],
    [1673913600000, 73.0],
    [1674000000000, 72.9],
    [1674086400000, 73.1],
    [1674172800000, 73.3],
    [1674259200000, 63.1],
    [1674345600000, 53.0],
    [1674432000000, 22.9],
    [1674518400000, 0],
    [1674604800000, 0],
    [1674691200000, 0],
    [1674777600000, 63.1],
    [1674864000000, 63.0],
    [1674950400000, 63.2],
    [1675036800000, 62.9],
];
CIIOverviewChart01_chart_Series_data03 = [
    [1672531200000, 0],
    [1672617600000, -1.5],
    [1672704000000, -1.5],
    [1672790400000, -1.5],
    [1672876800000, -1.5],
    [1672963200000, -1.5],
    [1673049600000, -1.5],
    [1673136000000, -1.5],
    [1673222400000, -1.5],
    [1673308800000, 0],
    [1673395200000, 0],
    [1673481600000, 0],
    [1673568000000, -1.5],
    [1673654400000, -1.5],
    [1673740800000, -1.5],
    [1673827200000, -1.5],
    [1673913600000, -1.5],
    [1674000000000, -1.5],
    [1674086400000, -1.5],
    [1674172800000, -1.5],
    [1674259200000, -1.5],
    [1674345600000, -1.5],
    [1674432000000, -1.5],
    [1674518400000, 0],
    [1674604800000, 0],
    [1674691200000, 0],
    [1674777600000, -1.5],
    [1674864000000, -1.5],
    [1674950400000, -1.5],
    [1675036800000, -1.5],
];
CIIOverviewChart01_chart_Series_data04 = [
    [1672531200000, -1.5],
    [1672617600000, 0],
    [1672704000000, 0],
    [1672790400000, 0],
    [1672876800000, 0],
    [1672963200000, 0],
    [1673049600000, 0],
    [1673136000000, 0],
    [1673222400000, 0],
    [1673308800000, -1.5],
    [1673395200000, -1.5],
    [1673481600000, -1.5],
    [1673568000000, 0],
    [1673654400000, 0],
    [1673740800000, 0],
    [1673827200000, 0],
    [1673913600000, 0],
    [1674000000000, 0],
    [1674086400000, 0],
    [1674172800000, 0],
    [1674259200000, 0],
    [1674345600000, 0],
    [1674432000000, 0],
    [1674518400000, -1.5],
    [1674604800000, -1.5],
    [1674691200000, -1.5],
    [1674777600000, 0],
    [1674864000000, 0],
    [1674950400000, 0],
    [1675036800000, 0],
];

Highcharts.chart('CIIOverviewChart01', {
    chart: {
        zooming: {
            type: 'x',
        },
        backgroundColor: '#292929',
        alignTicks: true,
        style: {
            color: '#fff',
        },
    },
    title: {
        text: '',
        style: {
            color: '#fff',
        },
    },
    subtitle: {
        text: ' ',
    },
    exporting: {
        enabled: false,
    },
    credits: {
        enabled: false,
    },
    xAxis: {
        type: 'datetime',
        lineColor: '#FFF',
        tickColor: '#FFF',
        min: Date.UTC(2023, 0, 1), // 年初
        max: Date.UTC(2023, 12, 31), // 年底
        labels: {
            style: {
                color: '#fff',
            },
        },
        title: {
            style: {
                color: '#FFF',
            },
        },
    },
    yAxis: [
        {
            // 第一組的 Y 軸
            title: {
                text: 'CII 評級',
                style: {
                    color: '#fff',
                },
            },
            labels: {
                style: {
                    color: '#fff',
                },
                formatter: function () {
                    return this.value >= 0 ? this.value : ''; // 不顯示小於 0 的標籤
                },
                min: -5,
                max: 20,
                tickPositions: [-5, 0, 5, 10, 15, 20],
            },
        },
        {
            // 第二組的 Y 軸
            title: {
                text: 'MCR (%)',
                style: {
                    color: '#fff',
                },
            },
            labels: {
                style: {
                    color: '#FFF',
                },
                formatter: function () {
                    return this.value >= 0 ? this.value : ''; //不顯示小於 0 的標籤
                },
            },
            opposite: true,
            min: -25,
            max: 100,
            tickPositions: [-25, 0, 25, 50, 75, 100],
        },
    ],
    legend: {
        align: 'right', // 水平對齊右邊
        verticalAlign: 'bottom', // 垂直對齊上方
        x: -40,
        // y: 20,
        itemStyle: {
            color: '#FFF',
        },
    },
    plotOptions: {
        series: {
            marker: {
                enabled: true, // 第一組和第二組顯示數值點
            },
            lineWidth: 2, // 設定線的寬度
            label: { enabled: false },
        },
        area: {
            marker: {
                enabled: false, // 隱藏第三組的數值點
            },
            lineWidth: 0, // 去除第三組的數值線
            states: {
                hover: {
                    enabled: false, // 禁用滑鼠懸停時的效果
                },
            },
        },
    },
    tooltip: {
        enabled: false,
    },
    series: [
        {
            type: 'line',
            name: '已經達成 CII',
            data: CIIOverviewChart01_chart_Series_data01,
            marker: {
                enabled: false, // 不顯示點
            },
        },
        {
            type: 'line',
            name: '目標 CII',
            data: CIIOverviewChart01_chart_redLine,
            color: 'red',
            enableMouseTracking: false, // 不啟用 tooltip
            marker: {
                enabled: false, // 不顯示點
            },
            showInLegend: true,
        },
        {
            type: 'line',
            name: '% MCR',
            data: CIIOverviewChart01_chart_Series_data02,
            dataLabels: {
                enabled: false, // 不在圖上顯示系列名稱或數值
            },
            color: '#999', // 將第二組顏色改為白
            marker: {
                enabled: false, // 不顯示點
            },
            yAxis: 1, // 指定使用第二個 Y 軸
        },
        {
            type: 'area',
            name: '航行中',
            data: CIIOverviewChart01_chart_Series_data03,
            color: '#50C2E1', // 使用不同顏色以區分
            fillOpacity: 0.9, // 設定填充的透明度
            step: 'left',
            zones: [
                {
                    value: -0.8,
                    color: '#50C2E1', // -2 到 -0.8 的區域顏色
                },
                {
                    color: 'transparent', // 超過 -0.8 的區域顏色
                },
            ],
        },
        {
            type: 'area',
            name: '等泊',
            data: CIIOverviewChart01_chart_Series_data04,
            color: '#DE8D42',
            fillOpacity: 0.9,
            step: 'left',
            zones: [
                {
                    value: -0.8,
                    color: '#DE8D42',
                },
                {
                    color: 'transparent',
                },
            ],
        },
    ],
});
